//================================================================
//
// 基本のカメラシステム[BaseCameraSysmte.h]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// インクルード
//****************************************************************

//****************************************************************
// 前方宣言
//****************************************************************
class CCamera;

//****************************************************************
// クラス定義
//****************************************************************
class CBaseCameraSystem
{
public:
	CBaseCameraSystem() = default;
	virtual ~CBaseCameraSystem() = default;

	virtual void Init(void) = 0;
	virtual void Update(void) = 0;
	virtual void Uninit(void) = 0;

	/// <summary>
	/// オーナーを設定
	/// </summary>
	/// <param name="_Owner">オーナー</param>
	inline void SetOwner(CCamera* _Owner) { m_pOwner = _Owner; }
protected:
	// オーナー
	CCamera* m_pOwner;
};