//================================================================
//
// スカイボックスの描画システムの処理[RenderingSkyBoxSystem.h]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// インクルード
//****************************************************************
#include "System/Rendering/baseRenderingsystem.hpp"

//****************************************************************
// スカイボックスの描画
//****************************************************************
struct RenderingSkyBoxSystem final : BaseRenderingSystem
{
	/// <summary>
	/// 描画
	/// </summary>
	/// <param name="Reg">レジストリー</param>
	void Rendering(entt::registry& Reg)override;
};