//================================================================
//
// 更新システムの基底クラスの処理[BaseUpdatesystem.hpp]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// 基底クラス
//****************************************************************
struct BaseSystem
{
	/// <summary>
	/// コンストラクタ
	/// </summary>
	/// <param name="RefPause">ポーズを参照するかどうか</param>
	BaseSystem(const bool RefPause = true) { IsRefPause = RefPause; };

	virtual ~BaseSystem() = default;
	virtual void Update(entt::registry& reg) = 0;
	// ポーズを参照するかどうか
	bool IsRefPause;
};