//================================================================
//
// ポーズメニューの更新処理[UpdatePauseMenuSystem.h]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// インクルード
//****************************************************************
#include "BaseUpdatesystem.hpp"

//****************************************************************
// ポーズメニューのアップデート
//****************************************************************
struct UpdatePauseMenuSystem final : BaseSystem
{
	/// <summary>
	/// コンストラクタ(ポーズを参照しない)
	/// </summary>
	UpdatePauseMenuSystem() : BaseSystem(false) {};
	/// <summary>
	/// 更新
	/// </summary>
	/// <param name="Reg">レジストリー</param>
	void Update(entt::registry& Reg)override;
};