//================================================================
//
// アイテム更新システムの処理[UpdateItemSystem.h]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// インクルード
//****************************************************************
#include "BaSeUpdatesystem.hpp"

//****************************************************************
// アイテムの更新
//****************************************************************
struct UpdateItemSystem final : BaseSystem
{
	/// <summary>
	/// 更新
	/// </summary>
	/// <param name="Reg">レジストリー</param>
	void Update(entt::registry& Reg)override;
private:
	/// <summary>
	/// ロックオンアニメーション
	/// </summary>
	/// <param name="Reg">レジストリー</param>
	/// <param name="Entity">アイテム</param>
	void UpdateLockOn(entt::registry& Reg, entt::entity& Entity);
};