//================================================================
//
// メッシュレーザー描画システム[RenderingMeshLaserSystem.h]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// インクルード
//****************************************************************
#include "System/Rendering/baseRenderingsystem.hpp"

//****************************************************************s
// メッシュレーザー描画システム
//****************************************************************
struct RenderMehLaerSystem final : BaseRenderingSystem
{
	/// <summary>
	/// 描画
	/// </summary>
	/// <param name="Reg">レジストリー</param>
	void Rendering(entt::registry& Reg)override;
};