//================================================================
//
// メッシュフィールド描画システム[RenderingMeshFieldSystem.h]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// インクルード
//****************************************************************
#include "System/Rendering/baseRenderingsystem.hpp"

//****************************************************************
// メッシュフィールド描画システム
//****************************************************************
struct RenderMehFieldSystem final : BaseRenderingSystem
{
	/// <summary>
	/// 描画
	/// </summary>
	/// <param name="Reg">レジストリー</param>
	void Rendering(entt::registry& Reg)override;
};