//****************************************************************
//
// プレイヤーの最初のアニメーションのコンポーネント[PlayerAnimationComponent.hpp]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// プレイヤーの最初のアニメーションの情報
//****************************************************************
struct PlayerAnimComponent {
	// プレイヤーのアニメーション情報
	int FirstDelayCounter = 0;
	int FirstDelayFrame = 120;
	bool IsFinishedBelt = false;
	bool IsFinishedBeltOld = false;
	// スクリーン上にプレイヤーがいるかどうか
	bool IsScreen = false;
	// アニメーションが終了したかどうか
	bool IsFinishedAnim = false;
};