//================================================================
//
// タイトルプレイヤー更新システムの処理[UpdateTitlePlayerSystem.h]
// Author Kensaku Hatori
//
//================================================================

//****************************************************************
// 二重インクルード防止
//****************************************************************
#pragma once

//****************************************************************
// インクルード
//****************************************************************
#include "System/Update/BaseUpdatesystem.hpp"
#include "Component/TransformComponent.hpp"

//****************************************************************
// タイトルプレイヤーのアップデート
//****************************************************************
struct UpdateTitlePlayerSystem final : BaseSystem
{
	/// <summary>
	/// 更新
	/// </summary>
	/// <param name="Reg">レジストリー</param>
	void Update(entt::registry& Reg)override;
};